SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_protimer.h
/* Bit fields for PROTIMER SFMIF */
#define _PROTIMER_SFMIF_RESETVALUE                       0x00000000UL                                       /**< Default value for PROTIMER_SFMIF            */
#define _PROTIMER_SFMIF_MASK                             0x3FFFFFF7UL                                       /**< Mask for PROTIMER_SFMIF                     */
#define PROTIMER_SFMIF_PRECNTOFSFMIF                     (0x1UL << 0)                                       /**< PRECNT Overflow Interrupt Flag              */
#define _PROTIMER_SFMIF_PRECNTOFSFMIF_SHIFT              0                                                  /**< Shift value for PROTIMER_PRECNTOFSFMIF      */
#define _PROTIMER_SFMIF_PRECNTOFSFMIF_MASK               0x1UL                                              /**< Bit mask for PROTIMER_PRECNTOFSFMIF         */
#define _PROTIMER_SFMIF_PRECNTOFSFMIF_DEFAULT            0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_PRECNTOFSFMIF_DEFAULT             (_PROTIMER_SFMIF_PRECNTOFSFMIF_DEFAULT << 0)       /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_BASECNTOFSFMIF                    (0x1UL << 1)                                       /**< BASECNT Overflow Interrupt Flag             */
#define _PROTIMER_SFMIF_BASECNTOFSFMIF_SHIFT             1                                                  /**< Shift value for PROTIMER_BASECNTOFSFMIF     */
#define _PROTIMER_SFMIF_BASECNTOFSFMIF_MASK              0x2UL                                              /**< Bit mask for PROTIMER_BASECNTOFSFMIF        */
#define _PROTIMER_SFMIF_BASECNTOFSFMIF_DEFAULT           0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_BASECNTOFSFMIF_DEFAULT            (_PROTIMER_SFMIF_BASECNTOFSFMIF_DEFAULT << 1)      /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_WRAPCNTOFSFMIF                    (0x1UL << 2)                                       /**< WRAPCNT Overflow Interrupt Flag             */
#define _PROTIMER_SFMIF_WRAPCNTOFSFMIF_SHIFT             2                                                  /**< Shift value for PROTIMER_WRAPCNTOFSFMIF     */
#define _PROTIMER_SFMIF_WRAPCNTOFSFMIF_MASK              0x4UL                                              /**< Bit mask for PROTIMER_WRAPCNTOFSFMIF        */
#define _PROTIMER_SFMIF_WRAPCNTOFSFMIF_DEFAULT           0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_WRAPCNTOFSFMIF_DEFAULT            (_PROTIMER_SFMIF_WRAPCNTOFSFMIF_DEFAULT << 2)      /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_TOUT0SFMIF                        (0x1UL << 4)                                       /**< TOUT0 underflow interrupt flag              */
#define _PROTIMER_SFMIF_TOUT0SFMIF_SHIFT                 4                                                  /**< Shift value for PROTIMER_TOUT0SFMIF         */
#define _PROTIMER_SFMIF_TOUT0SFMIF_MASK                  0x10UL                                             /**< Bit mask for PROTIMER_TOUT0SFMIF            */
#define _PROTIMER_SFMIF_TOUT0SFMIF_DEFAULT               0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_TOUT0SFMIF_DEFAULT                (_PROTIMER_SFMIF_TOUT0SFMIF_DEFAULT << 4)          /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_TOUT1SFMIF                        (0x1UL << 5)                                       /**< TOUT1 underflow interrupt flag              */
#define _PROTIMER_SFMIF_TOUT1SFMIF_SHIFT                 5                                                  /**< Shift value for PROTIMER_TOUT1SFMIF         */
#define _PROTIMER_SFMIF_TOUT1SFMIF_MASK                  0x20UL                                             /**< Bit mask for PROTIMER_TOUT1SFMIF            */
#define _PROTIMER_SFMIF_TOUT1SFMIF_DEFAULT               0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_TOUT1SFMIF_DEFAULT                (_PROTIMER_SFMIF_TOUT1SFMIF_DEFAULT << 5)          /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_TOUT0MATCHSFMIF                   (0x1UL << 6)                                       /**< TOUT0 compare match interrupt flag          */
#define _PROTIMER_SFMIF_TOUT0MATCHSFMIF_SHIFT            6                                                  /**< Shift value for PROTIMER_TOUT0MATCHSFMIF    */
#define _PROTIMER_SFMIF_TOUT0MATCHSFMIF_MASK             0x40UL                                             /**< Bit mask for PROTIMER_TOUT0MATCHSFMIF       */
#define _PROTIMER_SFMIF_TOUT0MATCHSFMIF_DEFAULT          0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_TOUT0MATCHSFMIF_DEFAULT           (_PROTIMER_SFMIF_TOUT0MATCHSFMIF_DEFAULT << 6)     /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_TOUT1MATCHSFMIF                   (0x1UL << 7)                                       /**< TOUT1 compare match interrupt flag          */
#define _PROTIMER_SFMIF_TOUT1MATCHSFMIF_SHIFT            7                                                  /**< Shift value for PROTIMER_TOUT1MATCHSFMIF    */
#define _PROTIMER_SFMIF_TOUT1MATCHSFMIF_MASK             0x80UL                                             /**< Bit mask for PROTIMER_TOUT1MATCHSFMIF       */
#define _PROTIMER_SFMIF_TOUT1MATCHSFMIF_DEFAULT          0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_TOUT1MATCHSFMIF_DEFAULT           (_PROTIMER_SFMIF_TOUT1MATCHSFMIF_DEFAULT << 7)     /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_CC0SFMIF                          (0x1UL << 8)                                       /**< CC Channel 0 Interrupt Flag                 */
#define _PROTIMER_SFMIF_CC0SFMIF_SHIFT                   8                                                  /**< Shift value for PROTIMER_CC0SFMIF           */
#define _PROTIMER_SFMIF_CC0SFMIF_MASK                    0x100UL                                            /**< Bit mask for PROTIMER_CC0SFMIF              */
#define _PROTIMER_SFMIF_CC0SFMIF_DEFAULT                 0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_CC0SFMIF_DEFAULT                  (_PROTIMER_SFMIF_CC0SFMIF_DEFAULT << 8)            /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_CC1SFMIF                          (0x1UL << 9)                                       /**< CC Channel 1 Interrupt Flag                 */
#define _PROTIMER_SFMIF_CC1SFMIF_SHIFT                   9                                                  /**< Shift value for PROTIMER_CC1SFMIF           */
#define _PROTIMER_SFMIF_CC1SFMIF_MASK                    0x200UL                                            /**< Bit mask for PROTIMER_CC1SFMIF              */
#define _PROTIMER_SFMIF_CC1SFMIF_DEFAULT                 0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_CC1SFMIF_DEFAULT                  (_PROTIMER_SFMIF_CC1SFMIF_DEFAULT << 9)            /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_CC2SFMIF                          (0x1UL << 10)                                      /**< CC Channel 2 Interrupt Flag                 */
#define _PROTIMER_SFMIF_CC2SFMIF_SHIFT                   10                                                 /**< Shift value for PROTIMER_CC2SFMIF           */
#define _PROTIMER_SFMIF_CC2SFMIF_MASK                    0x400UL                                            /**< Bit mask for PROTIMER_CC2SFMIF              */
#define _PROTIMER_SFMIF_CC2SFMIF_DEFAULT                 0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_CC2SFMIF_DEFAULT                  (_PROTIMER_SFMIF_CC2SFMIF_DEFAULT << 10)           /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_CC3SFMIF                          (0x1UL << 11)                                      /**< CC Channel 3 Interrupt Flag                 */
#define _PROTIMER_SFMIF_CC3SFMIF_SHIFT                   11                                                 /**< Shift value for PROTIMER_CC3SFMIF           */
#define _PROTIMER_SFMIF_CC3SFMIF_MASK                    0x800UL                                            /**< Bit mask for PROTIMER_CC3SFMIF              */
#define _PROTIMER_SFMIF_CC3SFMIF_DEFAULT                 0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_CC3SFMIF_DEFAULT                  (_PROTIMER_SFMIF_CC3SFMIF_DEFAULT << 11)           /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_CC4SFMIF                          (0x1UL << 12)                                      /**< CC Channel 4 Interrupt Flag                 */
#define _PROTIMER_SFMIF_CC4SFMIF_SHIFT                   12                                                 /**< Shift value for PROTIMER_CC4SFMIF           */
#define _PROTIMER_SFMIF_CC4SFMIF_MASK                    0x1000UL                                           /**< Bit mask for PROTIMER_CC4SFMIF              */
#define _PROTIMER_SFMIF_CC4SFMIF_DEFAULT                 0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_CC4SFMIF_DEFAULT                  (_PROTIMER_SFMIF_CC4SFMIF_DEFAULT << 12)           /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_CC5SFMIF                          (0x1UL << 13)                                      /**< CC Channel 5 Interrupt Flag                 */
#define _PROTIMER_SFMIF_CC5SFMIF_SHIFT                   13                                                 /**< Shift value for PROTIMER_CC5SFMIF           */
#define _PROTIMER_SFMIF_CC5SFMIF_MASK                    0x2000UL                                           /**< Bit mask for PROTIMER_CC5SFMIF              */
#define _PROTIMER_SFMIF_CC5SFMIF_DEFAULT                 0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_CC5SFMIF_DEFAULT                  (_PROTIMER_SFMIF_CC5SFMIF_DEFAULT << 13)           /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_CC6SFMIF                          (0x1UL << 14)                                      /**< CC Channel 6 Interrupt Flag                 */
#define _PROTIMER_SFMIF_CC6SFMIF_SHIFT                   14                                                 /**< Shift value for PROTIMER_CC6SFMIF           */
#define _PROTIMER_SFMIF_CC6SFMIF_MASK                    0x4000UL                                           /**< Bit mask for PROTIMER_CC6SFMIF              */
#define _PROTIMER_SFMIF_CC6SFMIF_DEFAULT                 0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_CC6SFMIF_DEFAULT                  (_PROTIMER_SFMIF_CC6SFMIF_DEFAULT << 14)           /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_CC7SFMIF                          (0x1UL << 15)                                      /**< CC Channel 7 Interrupt Flag                 */
#define _PROTIMER_SFMIF_CC7SFMIF_SHIFT                   15                                                 /**< Shift value for PROTIMER_CC7SFMIF           */
#define _PROTIMER_SFMIF_CC7SFMIF_MASK                    0x8000UL                                           /**< Bit mask for PROTIMER_CC7SFMIF              */
#define _PROTIMER_SFMIF_CC7SFMIF_DEFAULT                 0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_CC7SFMIF_DEFAULT                  (_PROTIMER_SFMIF_CC7SFMIF_DEFAULT << 15)           /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_COF0SFMIF                         (0x1UL << 16)                                      /**< CC Channel 0 Overflow Interrupt Flag        */
#define _PROTIMER_SFMIF_COF0SFMIF_SHIFT                  16                                                 /**< Shift value for PROTIMER_COF0SFMIF          */
#define _PROTIMER_SFMIF_COF0SFMIF_MASK                   0x10000UL                                          /**< Bit mask for PROTIMER_COF0SFMIF             */
#define _PROTIMER_SFMIF_COF0SFMIF_DEFAULT                0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_COF0SFMIF_DEFAULT                 (_PROTIMER_SFMIF_COF0SFMIF_DEFAULT << 16)          /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_COF1SFMIF                         (0x1UL << 17)                                      /**< CC Channel 1 Overflow Interrupt Flag        */
#define _PROTIMER_SFMIF_COF1SFMIF_SHIFT                  17                                                 /**< Shift value for PROTIMER_COF1SFMIF          */
#define _PROTIMER_SFMIF_COF1SFMIF_MASK                   0x20000UL                                          /**< Bit mask for PROTIMER_COF1SFMIF             */
#define _PROTIMER_SFMIF_COF1SFMIF_DEFAULT                0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_COF1SFMIF_DEFAULT                 (_PROTIMER_SFMIF_COF1SFMIF_DEFAULT << 17)          /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_COF2SFMIF                         (0x1UL << 18)                                      /**< CC Channel 2 Overflow Interrupt Flag        */
#define _PROTIMER_SFMIF_COF2SFMIF_SHIFT                  18                                                 /**< Shift value for PROTIMER_COF2SFMIF          */
#define _PROTIMER_SFMIF_COF2SFMIF_MASK                   0x40000UL                                          /**< Bit mask for PROTIMER_COF2SFMIF             */
#define _PROTIMER_SFMIF_COF2SFMIF_DEFAULT                0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_COF2SFMIF_DEFAULT                 (_PROTIMER_SFMIF_COF2SFMIF_DEFAULT << 18)          /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_COF3SFMIF                         (0x1UL << 19)                                      /**< CC Channel 3 Overflow Interrupt Flag        */
#define _PROTIMER_SFMIF_COF3SFMIF_SHIFT                  19                                                 /**< Shift value for PROTIMER_COF3SFMIF          */
#define _PROTIMER_SFMIF_COF3SFMIF_MASK                   0x80000UL                                          /**< Bit mask for PROTIMER_COF3SFMIF             */
#define _PROTIMER_SFMIF_COF3SFMIF_DEFAULT                0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_COF3SFMIF_DEFAULT                 (_PROTIMER_SFMIF_COF3SFMIF_DEFAULT << 19)          /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_COF4SFMIF                         (0x1UL << 20)                                      /**< CC Channel 4 Overflow Interrupt Flag        */
#define _PROTIMER_SFMIF_COF4SFMIF_SHIFT                  20                                                 /**< Shift value for PROTIMER_COF4SFMIF          */
#define _PROTIMER_SFMIF_COF4SFMIF_MASK                   0x100000UL                                         /**< Bit mask for PROTIMER_COF4SFMIF             */
#define _PROTIMER_SFMIF_COF4SFMIF_DEFAULT                0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_COF4SFMIF_DEFAULT                 (_PROTIMER_SFMIF_COF4SFMIF_DEFAULT << 20)          /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_COF5SFMIF                         (0x1UL << 21)                                      /**< CC Channel 5 Overflow Interrupt Flag        */
#define _PROTIMER_SFMIF_COF5SFMIF_SHIFT                  21                                                 /**< Shift value for PROTIMER_COF5SFMIF          */
#define _PROTIMER_SFMIF_COF5SFMIF_MASK                   0x200000UL                                         /**< Bit mask for PROTIMER_COF5SFMIF             */
#define _PROTIMER_SFMIF_COF5SFMIF_DEFAULT                0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_COF5SFMIF_DEFAULT                 (_PROTIMER_SFMIF_COF5SFMIF_DEFAULT << 21)          /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_COF6SFMIF                         (0x1UL << 22)                                      /**< CC Channel 6 Overflow Interrupt Flag        */
#define _PROTIMER_SFMIF_COF6SFMIF_SHIFT                  22                                                 /**< Shift value for PROTIMER_COF6SFMIF          */
#define _PROTIMER_SFMIF_COF6SFMIF_MASK                   0x400000UL                                         /**< Bit mask for PROTIMER_COF6SFMIF             */
#define _PROTIMER_SFMIF_COF6SFMIF_DEFAULT                0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_COF6SFMIF_DEFAULT                 (_PROTIMER_SFMIF_COF6SFMIF_DEFAULT << 22)          /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_COF7SFMIF                         (0x1UL << 23)                                      /**< CC Channel 7 Overflow Interrupt Flag        */
#define _PROTIMER_SFMIF_COF7SFMIF_SHIFT                  23                                                 /**< Shift value for PROTIMER_COF7SFMIF          */
#define _PROTIMER_SFMIF_COF7SFMIF_MASK                   0x800000UL                                         /**< Bit mask for PROTIMER_COF7SFMIF             */
#define _PROTIMER_SFMIF_COF7SFMIF_DEFAULT                0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_COF7SFMIF_DEFAULT                 (_PROTIMER_SFMIF_COF7SFMIF_DEFAULT << 23)          /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_LBTSUCCESSSFMIF                   (0x1UL << 24)                                      /**< Listen Before Talk Success                  */
#define _PROTIMER_SFMIF_LBTSUCCESSSFMIF_SHIFT            24                                                 /**< Shift value for PROTIMER_LBTSUCCESSSFMIF    */
#define _PROTIMER_SFMIF_LBTSUCCESSSFMIF_MASK             0x1000000UL                                        /**< Bit mask for PROTIMER_LBTSUCCESSSFMIF       */
#define _PROTIMER_SFMIF_LBTSUCCESSSFMIF_DEFAULT          0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_LBTSUCCESSSFMIF_DEFAULT           (_PROTIMER_SFMIF_LBTSUCCESSSFMIF_DEFAULT << 24)    /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_LBTFAILURESFMIF                   (0x1UL << 25)                                      /**< Listen Before Talk Failure                  */
#define _PROTIMER_SFMIF_LBTFAILURESFMIF_SHIFT            25                                                 /**< Shift value for PROTIMER_LBTFAILURESFMIF    */
#define _PROTIMER_SFMIF_LBTFAILURESFMIF_MASK             0x2000000UL                                        /**< Bit mask for PROTIMER_LBTFAILURESFMIF       */
#define _PROTIMER_SFMIF_LBTFAILURESFMIF_DEFAULT          0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_LBTFAILURESFMIF_DEFAULT           (_PROTIMER_SFMIF_LBTFAILURESFMIF_DEFAULT << 25)    /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_LBTPAUSEDSFMIF                    (0x1UL << 26)                                      /**< Listen Before Talk Paused                   */
#define _PROTIMER_SFMIF_LBTPAUSEDSFMIF_SHIFT             26                                                 /**< Shift value for PROTIMER_LBTPAUSEDSFMIF     */
#define _PROTIMER_SFMIF_LBTPAUSEDSFMIF_MASK              0x4000000UL                                        /**< Bit mask for PROTIMER_LBTPAUSEDSFMIF        */
#define _PROTIMER_SFMIF_LBTPAUSEDSFMIF_DEFAULT           0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_LBTPAUSEDSFMIF_DEFAULT            (_PROTIMER_SFMIF_LBTPAUSEDSFMIF_DEFAULT << 26)     /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_LBTRETRYSFMIF                     (0x1UL << 27)                                      /**< Listen Before Talk Retry                    */
#define _PROTIMER_SFMIF_LBTRETRYSFMIF_SHIFT              27                                                 /**< Shift value for PROTIMER_LBTRETRYSFMIF      */
#define _PROTIMER_SFMIF_LBTRETRYSFMIF_MASK               0x8000000UL                                        /**< Bit mask for PROTIMER_LBTRETRYSFMIF         */
#define _PROTIMER_SFMIF_LBTRETRYSFMIF_DEFAULT            0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_LBTRETRYSFMIF_DEFAULT             (_PROTIMER_SFMIF_LBTRETRYSFMIF_DEFAULT << 27)      /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_RTCCSYNCHEDSFMIF                  (0x1UL << 28)                                      /**< PROTIMER synchronized with the RTCC         */
#define _PROTIMER_SFMIF_RTCCSYNCHEDSFMIF_SHIFT           28                                                 /**< Shift value for PROTIMER_RTCCSYNCHEDSFMIF   */
#define _PROTIMER_SFMIF_RTCCSYNCHEDSFMIF_MASK            0x10000000UL                                       /**< Bit mask for PROTIMER_RTCCSYNCHEDSFMIF      */
#define _PROTIMER_SFMIF_RTCCSYNCHEDSFMIF_DEFAULT         0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_RTCCSYNCHEDSFMIF_DEFAULT          (_PROTIMER_SFMIF_RTCCSYNCHEDSFMIF_DEFAULT << 28)   /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */
#define PROTIMER_SFMIF_TOUT0MATCHLBTSFMIF                (0x1UL << 29)                                      /**< TOUT0 compare match interrupt flag          */
#define _PROTIMER_SFMIF_TOUT0MATCHLBTSFMIF_SHIFT         29                                                 /**< Shift value for PROTIMER_TOUT0MATCHLBTSFMIF */
#define _PROTIMER_SFMIF_TOUT0MATCHLBTSFMIF_MASK          0x20000000UL                                       /**< Bit mask for PROTIMER_TOUT0MATCHLBTSFMIF    */
#define _PROTIMER_SFMIF_TOUT0MATCHLBTSFMIF_DEFAULT       0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_SFMIF             */
#define PROTIMER_SFMIF_TOUT0MATCHLBTSFMIF_DEFAULT        (_PROTIMER_SFMIF_TOUT0MATCHLBTSFMIF_DEFAULT << 29) /**< Shifted mode DEFAULT for PROTIMER_SFMIF     */

