SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_protimer.h
/* Bit fields for PROTIMER SFMIEN */
#define _PROTIMER_SFMIEN_RESETVALUE                      0x00000000UL                                         /**< Default value for PROTIMER_SFMIEN           */
#define _PROTIMER_SFMIEN_MASK                            0x3FFFFFF7UL                                         /**< Mask for PROTIMER_SFMIEN                    */
#define PROTIMER_SFMIEN_PRECNTOFSFMIEN                   (0x1UL << 0)                                         /**< PRECNTOF Interrupt Enable                   */
#define _PROTIMER_SFMIEN_PRECNTOFSFMIEN_SHIFT            0                                                    /**< Shift value for PROTIMER_PRECNTOFSFMIEN     */
#define _PROTIMER_SFMIEN_PRECNTOFSFMIEN_MASK             0x1UL                                                /**< Bit mask for PROTIMER_PRECNTOFSFMIEN        */
#define _PROTIMER_SFMIEN_PRECNTOFSFMIEN_DEFAULT          0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_PRECNTOFSFMIEN_DEFAULT           (_PROTIMER_SFMIEN_PRECNTOFSFMIEN_DEFAULT << 0)       /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_BASECNTOFSFMIEN                  (0x1UL << 1)                                         /**< BASECNTOF Interrupt Enable                  */
#define _PROTIMER_SFMIEN_BASECNTOFSFMIEN_SHIFT           1                                                    /**< Shift value for PROTIMER_BASECNTOFSFMIEN    */
#define _PROTIMER_SFMIEN_BASECNTOFSFMIEN_MASK            0x2UL                                                /**< Bit mask for PROTIMER_BASECNTOFSFMIEN       */
#define _PROTIMER_SFMIEN_BASECNTOFSFMIEN_DEFAULT         0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_BASECNTOFSFMIEN_DEFAULT          (_PROTIMER_SFMIEN_BASECNTOFSFMIEN_DEFAULT << 1)      /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_WRAPCNTOFSFMIEN                  (0x1UL << 2)                                         /**< WRAPCNTOF Interrupt Enable                  */
#define _PROTIMER_SFMIEN_WRAPCNTOFSFMIEN_SHIFT           2                                                    /**< Shift value for PROTIMER_WRAPCNTOFSFMIEN    */
#define _PROTIMER_SFMIEN_WRAPCNTOFSFMIEN_MASK            0x4UL                                                /**< Bit mask for PROTIMER_WRAPCNTOFSFMIEN       */
#define _PROTIMER_SFMIEN_WRAPCNTOFSFMIEN_DEFAULT         0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_WRAPCNTOFSFMIEN_DEFAULT          (_PROTIMER_SFMIEN_WRAPCNTOFSFMIEN_DEFAULT << 2)      /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_TOUT0SFMIEN                      (0x1UL << 4)                                         /**< TOUT0 Interrupt Enable                      */
#define _PROTIMER_SFMIEN_TOUT0SFMIEN_SHIFT               4                                                    /**< Shift value for PROTIMER_TOUT0SFMIEN        */
#define _PROTIMER_SFMIEN_TOUT0SFMIEN_MASK                0x10UL                                               /**< Bit mask for PROTIMER_TOUT0SFMIEN           */
#define _PROTIMER_SFMIEN_TOUT0SFMIEN_DEFAULT             0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_TOUT0SFMIEN_DEFAULT              (_PROTIMER_SFMIEN_TOUT0SFMIEN_DEFAULT << 4)          /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_TOUT1SFMIEN                      (0x1UL << 5)                                         /**< TOUT1 Interrupt Enable                      */
#define _PROTIMER_SFMIEN_TOUT1SFMIEN_SHIFT               5                                                    /**< Shift value for PROTIMER_TOUT1SFMIEN        */
#define _PROTIMER_SFMIEN_TOUT1SFMIEN_MASK                0x20UL                                               /**< Bit mask for PROTIMER_TOUT1SFMIEN           */
#define _PROTIMER_SFMIEN_TOUT1SFMIEN_DEFAULT             0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_TOUT1SFMIEN_DEFAULT              (_PROTIMER_SFMIEN_TOUT1SFMIEN_DEFAULT << 5)          /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_TOUT0MATCHSFMIEN                 (0x1UL << 6)                                         /**< TOUT0MATCH Interrupt Enable                 */
#define _PROTIMER_SFMIEN_TOUT0MATCHSFMIEN_SHIFT          6                                                    /**< Shift value for PROTIMER_TOUT0MATCHSFMIEN   */
#define _PROTIMER_SFMIEN_TOUT0MATCHSFMIEN_MASK           0x40UL                                               /**< Bit mask for PROTIMER_TOUT0MATCHSFMIEN      */
#define _PROTIMER_SFMIEN_TOUT0MATCHSFMIEN_DEFAULT        0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_TOUT0MATCHSFMIEN_DEFAULT         (_PROTIMER_SFMIEN_TOUT0MATCHSFMIEN_DEFAULT << 6)     /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_TOUT1MATCHSFMIEN                 (0x1UL << 7)                                         /**< TOUT1MATCH Interrupt Enable                 */
#define _PROTIMER_SFMIEN_TOUT1MATCHSFMIEN_SHIFT          7                                                    /**< Shift value for PROTIMER_TOUT1MATCHSFMIEN   */
#define _PROTIMER_SFMIEN_TOUT1MATCHSFMIEN_MASK           0x80UL                                               /**< Bit mask for PROTIMER_TOUT1MATCHSFMIEN      */
#define _PROTIMER_SFMIEN_TOUT1MATCHSFMIEN_DEFAULT        0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_TOUT1MATCHSFMIEN_DEFAULT         (_PROTIMER_SFMIEN_TOUT1MATCHSFMIEN_DEFAULT << 7)     /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_CC0SFMIEN                        (0x1UL << 8)                                         /**< CC0 Interrupt Enable                        */
#define _PROTIMER_SFMIEN_CC0SFMIEN_SHIFT                 8                                                    /**< Shift value for PROTIMER_CC0SFMIEN          */
#define _PROTIMER_SFMIEN_CC0SFMIEN_MASK                  0x100UL                                              /**< Bit mask for PROTIMER_CC0SFMIEN             */
#define _PROTIMER_SFMIEN_CC0SFMIEN_DEFAULT               0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_CC0SFMIEN_DEFAULT                (_PROTIMER_SFMIEN_CC0SFMIEN_DEFAULT << 8)            /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_CC1SFMIEN                        (0x1UL << 9)                                         /**< CC1 Interrupt Enable                        */
#define _PROTIMER_SFMIEN_CC1SFMIEN_SHIFT                 9                                                    /**< Shift value for PROTIMER_CC1SFMIEN          */
#define _PROTIMER_SFMIEN_CC1SFMIEN_MASK                  0x200UL                                              /**< Bit mask for PROTIMER_CC1SFMIEN             */
#define _PROTIMER_SFMIEN_CC1SFMIEN_DEFAULT               0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_CC1SFMIEN_DEFAULT                (_PROTIMER_SFMIEN_CC1SFMIEN_DEFAULT << 9)            /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_CC2SFMIEN                        (0x1UL << 10)                                        /**< CC2 Interrupt Enable                        */
#define _PROTIMER_SFMIEN_CC2SFMIEN_SHIFT                 10                                                   /**< Shift value for PROTIMER_CC2SFMIEN          */
#define _PROTIMER_SFMIEN_CC2SFMIEN_MASK                  0x400UL                                              /**< Bit mask for PROTIMER_CC2SFMIEN             */
#define _PROTIMER_SFMIEN_CC2SFMIEN_DEFAULT               0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_CC2SFMIEN_DEFAULT                (_PROTIMER_SFMIEN_CC2SFMIEN_DEFAULT << 10)           /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_CC3SFMIEN                        (0x1UL << 11)                                        /**< CC3 Interrupt Enable                        */
#define _PROTIMER_SFMIEN_CC3SFMIEN_SHIFT                 11                                                   /**< Shift value for PROTIMER_CC3SFMIEN          */
#define _PROTIMER_SFMIEN_CC3SFMIEN_MASK                  0x800UL                                              /**< Bit mask for PROTIMER_CC3SFMIEN             */
#define _PROTIMER_SFMIEN_CC3SFMIEN_DEFAULT               0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_CC3SFMIEN_DEFAULT                (_PROTIMER_SFMIEN_CC3SFMIEN_DEFAULT << 11)           /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_CC4SFMIEN                        (0x1UL << 12)                                        /**< CC4 Interrupt Enable                        */
#define _PROTIMER_SFMIEN_CC4SFMIEN_SHIFT                 12                                                   /**< Shift value for PROTIMER_CC4SFMIEN          */
#define _PROTIMER_SFMIEN_CC4SFMIEN_MASK                  0x1000UL                                             /**< Bit mask for PROTIMER_CC4SFMIEN             */
#define _PROTIMER_SFMIEN_CC4SFMIEN_DEFAULT               0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_CC4SFMIEN_DEFAULT                (_PROTIMER_SFMIEN_CC4SFMIEN_DEFAULT << 12)           /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_CC5SFMIEN                        (0x1UL << 13)                                        /**< CC5 Interrupt Enable                        */
#define _PROTIMER_SFMIEN_CC5SFMIEN_SHIFT                 13                                                   /**< Shift value for PROTIMER_CC5SFMIEN          */
#define _PROTIMER_SFMIEN_CC5SFMIEN_MASK                  0x2000UL                                             /**< Bit mask for PROTIMER_CC5SFMIEN             */
#define _PROTIMER_SFMIEN_CC5SFMIEN_DEFAULT               0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_CC5SFMIEN_DEFAULT                (_PROTIMER_SFMIEN_CC5SFMIEN_DEFAULT << 13)           /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_CC6SFMIEN                        (0x1UL << 14)                                        /**< CC6 Interrupt Enable                        */
#define _PROTIMER_SFMIEN_CC6SFMIEN_SHIFT                 14                                                   /**< Shift value for PROTIMER_CC6SFMIEN          */
#define _PROTIMER_SFMIEN_CC6SFMIEN_MASK                  0x4000UL                                             /**< Bit mask for PROTIMER_CC6SFMIEN             */
#define _PROTIMER_SFMIEN_CC6SFMIEN_DEFAULT               0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_CC6SFMIEN_DEFAULT                (_PROTIMER_SFMIEN_CC6SFMIEN_DEFAULT << 14)           /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_CC7SFMIEN                        (0x1UL << 15)                                        /**< CC7 Interrupt Enable                        */
#define _PROTIMER_SFMIEN_CC7SFMIEN_SHIFT                 15                                                   /**< Shift value for PROTIMER_CC7SFMIEN          */
#define _PROTIMER_SFMIEN_CC7SFMIEN_MASK                  0x8000UL                                             /**< Bit mask for PROTIMER_CC7SFMIEN             */
#define _PROTIMER_SFMIEN_CC7SFMIEN_DEFAULT               0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_CC7SFMIEN_DEFAULT                (_PROTIMER_SFMIEN_CC7SFMIEN_DEFAULT << 15)           /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_COF0SFMIEN                       (0x1UL << 16)                                        /**< COF0 Interrupt Enable                       */
#define _PROTIMER_SFMIEN_COF0SFMIEN_SHIFT                16                                                   /**< Shift value for PROTIMER_COF0SFMIEN         */
#define _PROTIMER_SFMIEN_COF0SFMIEN_MASK                 0x10000UL                                            /**< Bit mask for PROTIMER_COF0SFMIEN            */
#define _PROTIMER_SFMIEN_COF0SFMIEN_DEFAULT              0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_COF0SFMIEN_DEFAULT               (_PROTIMER_SFMIEN_COF0SFMIEN_DEFAULT << 16)          /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_COF1SFMIEN                       (0x1UL << 17)                                        /**< COF1 Interrupt Enable                       */
#define _PROTIMER_SFMIEN_COF1SFMIEN_SHIFT                17                                                   /**< Shift value for PROTIMER_COF1SFMIEN         */
#define _PROTIMER_SFMIEN_COF1SFMIEN_MASK                 0x20000UL                                            /**< Bit mask for PROTIMER_COF1SFMIEN            */
#define _PROTIMER_SFMIEN_COF1SFMIEN_DEFAULT              0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_COF1SFMIEN_DEFAULT               (_PROTIMER_SFMIEN_COF1SFMIEN_DEFAULT << 17)          /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_COF2SFMIEN                       (0x1UL << 18)                                        /**< COF2 Interrupt Enable                       */
#define _PROTIMER_SFMIEN_COF2SFMIEN_SHIFT                18                                                   /**< Shift value for PROTIMER_COF2SFMIEN         */
#define _PROTIMER_SFMIEN_COF2SFMIEN_MASK                 0x40000UL                                            /**< Bit mask for PROTIMER_COF2SFMIEN            */
#define _PROTIMER_SFMIEN_COF2SFMIEN_DEFAULT              0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_COF2SFMIEN_DEFAULT               (_PROTIMER_SFMIEN_COF2SFMIEN_DEFAULT << 18)          /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_COF3SFMIEN                       (0x1UL << 19)                                        /**< COF3 Interrupt Enable                       */
#define _PROTIMER_SFMIEN_COF3SFMIEN_SHIFT                19                                                   /**< Shift value for PROTIMER_COF3SFMIEN         */
#define _PROTIMER_SFMIEN_COF3SFMIEN_MASK                 0x80000UL                                            /**< Bit mask for PROTIMER_COF3SFMIEN            */
#define _PROTIMER_SFMIEN_COF3SFMIEN_DEFAULT              0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_COF3SFMIEN_DEFAULT               (_PROTIMER_SFMIEN_COF3SFMIEN_DEFAULT << 19)          /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_COF4SFMIEN                       (0x1UL << 20)                                        /**< COF4 Interrupt Enable                       */
#define _PROTIMER_SFMIEN_COF4SFMIEN_SHIFT                20                                                   /**< Shift value for PROTIMER_COF4SFMIEN         */
#define _PROTIMER_SFMIEN_COF4SFMIEN_MASK                 0x100000UL                                           /**< Bit mask for PROTIMER_COF4SFMIEN            */
#define _PROTIMER_SFMIEN_COF4SFMIEN_DEFAULT              0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_COF4SFMIEN_DEFAULT               (_PROTIMER_SFMIEN_COF4SFMIEN_DEFAULT << 20)          /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_COF5SFMIEN                       (0x1UL << 21)                                        /**< COF5 Interrupt Enable                       */
#define _PROTIMER_SFMIEN_COF5SFMIEN_SHIFT                21                                                   /**< Shift value for PROTIMER_COF5SFMIEN         */
#define _PROTIMER_SFMIEN_COF5SFMIEN_MASK                 0x200000UL                                           /**< Bit mask for PROTIMER_COF5SFMIEN            */
#define _PROTIMER_SFMIEN_COF5SFMIEN_DEFAULT              0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_COF5SFMIEN_DEFAULT               (_PROTIMER_SFMIEN_COF5SFMIEN_DEFAULT << 21)          /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_COF6SFMIEN                       (0x1UL << 22)                                        /**< COF6 Interrupt Enable                       */
#define _PROTIMER_SFMIEN_COF6SFMIEN_SHIFT                22                                                   /**< Shift value for PROTIMER_COF6SFMIEN         */
#define _PROTIMER_SFMIEN_COF6SFMIEN_MASK                 0x400000UL                                           /**< Bit mask for PROTIMER_COF6SFMIEN            */
#define _PROTIMER_SFMIEN_COF6SFMIEN_DEFAULT              0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_COF6SFMIEN_DEFAULT               (_PROTIMER_SFMIEN_COF6SFMIEN_DEFAULT << 22)          /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_COF7SFMIEN                       (0x1UL << 23)                                        /**< COF7 Interrupt Enable                       */
#define _PROTIMER_SFMIEN_COF7SFMIEN_SHIFT                23                                                   /**< Shift value for PROTIMER_COF7SFMIEN         */
#define _PROTIMER_SFMIEN_COF7SFMIEN_MASK                 0x800000UL                                           /**< Bit mask for PROTIMER_COF7SFMIEN            */
#define _PROTIMER_SFMIEN_COF7SFMIEN_DEFAULT              0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_COF7SFMIEN_DEFAULT               (_PROTIMER_SFMIEN_COF7SFMIEN_DEFAULT << 23)          /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_LBTSUCCESSSFMIEN                 (0x1UL << 24)                                        /**< LBTSUCCESS Interrupt Enable                 */
#define _PROTIMER_SFMIEN_LBTSUCCESSSFMIEN_SHIFT          24                                                   /**< Shift value for PROTIMER_LBTSUCCESSSFMIEN   */
#define _PROTIMER_SFMIEN_LBTSUCCESSSFMIEN_MASK           0x1000000UL                                          /**< Bit mask for PROTIMER_LBTSUCCESSSFMIEN      */
#define _PROTIMER_SFMIEN_LBTSUCCESSSFMIEN_DEFAULT        0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_LBTSUCCESSSFMIEN_DEFAULT         (_PROTIMER_SFMIEN_LBTSUCCESSSFMIEN_DEFAULT << 24)    /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_LBTFAILURESFMIEN                 (0x1UL << 25)                                        /**< LBTFAILURE Interrupt Enable                 */
#define _PROTIMER_SFMIEN_LBTFAILURESFMIEN_SHIFT          25                                                   /**< Shift value for PROTIMER_LBTFAILURESFMIEN   */
#define _PROTIMER_SFMIEN_LBTFAILURESFMIEN_MASK           0x2000000UL                                          /**< Bit mask for PROTIMER_LBTFAILURESFMIEN      */
#define _PROTIMER_SFMIEN_LBTFAILURESFMIEN_DEFAULT        0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_LBTFAILURESFMIEN_DEFAULT         (_PROTIMER_SFMIEN_LBTFAILURESFMIEN_DEFAULT << 25)    /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_LBTPAUSEDSFMIEN                  (0x1UL << 26)                                        /**< LBTPAUSED Interrupt Enable                  */
#define _PROTIMER_SFMIEN_LBTPAUSEDSFMIEN_SHIFT           26                                                   /**< Shift value for PROTIMER_LBTPAUSEDSFMIEN    */
#define _PROTIMER_SFMIEN_LBTPAUSEDSFMIEN_MASK            0x4000000UL                                          /**< Bit mask for PROTIMER_LBTPAUSEDSFMIEN       */
#define _PROTIMER_SFMIEN_LBTPAUSEDSFMIEN_DEFAULT         0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_LBTPAUSEDSFMIEN_DEFAULT          (_PROTIMER_SFMIEN_LBTPAUSEDSFMIEN_DEFAULT << 26)     /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_LBTRETRYSFMIEN                   (0x1UL << 27)                                        /**< LBTRETRY Interrupt Enable                   */
#define _PROTIMER_SFMIEN_LBTRETRYSFMIEN_SHIFT            27                                                   /**< Shift value for PROTIMER_LBTRETRYSFMIEN     */
#define _PROTIMER_SFMIEN_LBTRETRYSFMIEN_MASK             0x8000000UL                                          /**< Bit mask for PROTIMER_LBTRETRYSFMIEN        */
#define _PROTIMER_SFMIEN_LBTRETRYSFMIEN_DEFAULT          0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_LBTRETRYSFMIEN_DEFAULT           (_PROTIMER_SFMIEN_LBTRETRYSFMIEN_DEFAULT << 27)      /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_RTCCSYNCHEDSFMIEN                (0x1UL << 28)                                        /**< RTCCSYNCHED Interrupt Enable                */
#define _PROTIMER_SFMIEN_RTCCSYNCHEDSFMIEN_SHIFT         28                                                   /**< Shift value for PROTIMER_RTCCSYNCHEDSFMIEN  */
#define _PROTIMER_SFMIEN_RTCCSYNCHEDSFMIEN_MASK          0x10000000UL                                         /**< Bit mask for PROTIMER_RTCCSYNCHEDSFMIEN     */
#define _PROTIMER_SFMIEN_RTCCSYNCHEDSFMIEN_DEFAULT       0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_RTCCSYNCHEDSFMIEN_DEFAULT        (_PROTIMER_SFMIEN_RTCCSYNCHEDSFMIEN_DEFAULT << 28)   /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */
#define PROTIMER_SFMIEN_TOUT0MATCHLBTSFMIEN              (0x1UL << 29)                                        /**< TOUT0MATCHLBT Interrupt Enable              */
#define _PROTIMER_SFMIEN_TOUT0MATCHLBTSFMIEN_SHIFT       29                                                   /**< Shift value for PROTIMER_TOUT0MATCHLBTSFMIEN*/
#define _PROTIMER_SFMIEN_TOUT0MATCHLBTSFMIEN_MASK        0x20000000UL                                         /**< Bit mask for PROTIMER_TOUT0MATCHLBTSFMIEN   */
#define _PROTIMER_SFMIEN_TOUT0MATCHLBTSFMIEN_DEFAULT     0x00000000UL                                         /**< Mode DEFAULT for PROTIMER_SFMIEN            */
#define PROTIMER_SFMIEN_TOUT0MATCHLBTSFMIEN_DEFAULT      (_PROTIMER_SFMIEN_TOUT0MATCHLBTSFMIEN_DEFAULT << 29) /**< Shifted mode DEFAULT for PROTIMER_SFMIEN    */

